cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "arp-scan"
brew "automake"
brew "b2-tools"
brew "bash"
brew "bat"
brew "bison"
brew "blueutil"
brew "chruby"
brew "cmake"
brew "composer"
brew "diff-so-fancy"
brew "fd"
brew "ffmpeg"
brew "freeglut"
brew "fzf"
brew "gdbm"
brew "gh"
brew "gifsicle"
brew "git"
brew "grep"
brew "highlight"
brew "htop"
brew "imagemagick"
brew "jpegoptim"
brew "libffi"
brew "mackup"
brew "markdown"
brew "mas"
brew "mupdf"
brew "ncdu"
brew "nmap"
brew "node"
brew "noti"
brew "nvm"
brew "openjdk"
brew "optipng"
brew "oxipng"
brew "pandoc"
brew "php", restart_service: true
brew "php-code-sniffer", link: false
brew "php-cs-fixer"
brew "phpunit", link: false
brew "pillow"
brew "pipenv"
brew "pipx"
brew "pngcrush"
brew "pngquant"
brew "prettyping"
brew "ruby-install"
brew "s3cmd"
brew "subversion"
brew "the_silver_searcher"
brew "vim"
brew "webtorrent-cli"
brew "wget"
brew "wp-cli"
brew "wp-cli-completion"
brew "yt-dlp"
brew "zopfli"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "alchemy"
cask "alfred"
cask "android-platform-tools"
cask "anytype"
cask "audacity"
cask "betterdisplay"
cask "calibre"
cask "cleanmymac"
cask "devonthink"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-hack"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "handbrake"
cask "imageoptim"
cask "inkscape"
cask "inky"
cask "local"
cask "logi-options+"
cask "obs"
cask "obsidian"
cask "protonvpn"
cask "rar"
cask "rectangle"
cask "sequel-ace"
cask "sequel-pro"
cask "shottr"
cask "signal"
cask "sqlitestudio"
cask "steam"
cask "temurin"
cask "the-unarchiver"
cask "thonny"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "xnviewmp"
cask "yacreader"
cask "zoom"

mas "Amphetamine", id: 937984704
mas "Hand Mirror", id: 1502839586
mas "NextDNS", id: 1464122853
mas "PDFOptim", id: 621276561
mas "Pixelmator Pro", id: 1289583905
